Tekla Open API Reference for Tekla Structures 2025
View Methods
The View type exposes the following members.
Methods
Name | Description
CreateSnapshot
Delete
Deletes the view.
GetClipPlanes
Returns all the clip planes of the view.
Insert
Inserts a new view to the model.
IsPerspectiveViewProjection
Tells whether the view projection is a perspective projection.
IsVisible
Tells whether the view is currently visible.
Modify
Modifies the view parameters.
Select
Selects the view.
Top
See Also
Reference
View Class
Tekla.Structures.Model.UI Namespace